/*
Треба написати програму для нашийника, який одягають небезпечним тваринам: великим кішкам, великим приматам,
ведмедям та іншим. При ініціалізації нашийник відстежує пульс і температуру тварини, і з цього робить висновок,
що це за тварина. Далі записує інтенсивність дихання і звуків тварини. Якщо є сигнал від GPRS модуля — передає на
головний сервер (умовно), якщо немає, наприклад, тварина відійшла від зони покриття — записує у внутрішню памʼять,
але як сигнал зʼявиться — все накопичене передасть на головний сервер.
Де можна використати генеріки. Структура тварини передається у функцію, яка отримує дані від датчика дихання.
А потім у функцію, яка отримує дані від датчика звуку. Ця структура зберігає в собі зібрані дані та далі передає
їх на збереження (описано вище).
При реалізації треба використати канали та генеріки на рівні інтерфейсу, структури та її методів. Покрити
функції тестами.
*/
package main

import (
	"math/rand/v2"

	"github.com/sarff/prjctr-golang_beginning/gocourse08/collartask/collar"

	"github.com/sarff/prjctr-golang_beginning/gocourse08/collartask/animal"
)

func main() {
	tiger := animal.New(rand.IntN(100), rand.Float64(), animal.Tiger)
	collarDevice := collar.NewCollar()
	collarDevice.WearCollar(tiger)

	bear := animal.New(rand.IntN(100), rand.Float64(), animal.Bear)
	collarDevice.WearCollar(bear)
}
