package main

import (
	"fmt"

	"smartfeeder/activitymonitor"
	"smartfeeder/feeder"
	"smartfeeder/zone"
)

/*
На великій земельній ділянці заповідника стоїть велике сховище різних кормів для копитних тварин.
До нього підʼєднана електрона кормушка, яка аналізує стан біля себе: є тварини чи немає, які саме і скільки, якщо є.
У залежності від стану видає потрібну кількість потрібної їжі.
Варіанти сутностей:
Зона знаходження тварин, які харчуються: якщо тварина в цій зоні — кормушка видає корм.
Аналізатор зони знаходження: створює перелік тварин у зоні в момент часу.
Тварина: одиниця тварини.
Брекет корму: одиниця корму для певної тварини.
Притримуватися SOLID. Написати модульні тести. Можна використовувати горутини та генеріки.
*/

// TODO: Для аналізатора годівниці заюзати стратегію - типу залежно від тварини який корм, та заюзати другу
//  *не пам'ятаю як називається, від кількості тварин і віку (молода чи доросла) - кількість корму

func main() {
	feederMain := &feeder.Feeder{}
	zoneSetUp := &zone.Zone{}
	monitor := &activitymonitor.ActivityMonitor{
		ZoneCheck:                 zoneSetUp,
		DistributionAnimalsInZone: feederMain,
	}

	monitor.FeedDelivery()
	fmt.Println(zoneSetUp)
}
